<template>
  <div>
    <div class="bg-slate-950 w-[1280px] xl:w-full text-center pb-12">
      <UContainer>
        <div class="text-2xl text-green-500 font-medium py-12">
          {{ title }}
        </div>

        <div class="text-slate-400">
          <div v-for="(item, i) in moreDetail" :key="i" class="mb-5 last:mb-0">
            <div>{{ item.title }}</div>
            <div>{{ item.detail }}</div>
          </div>
        </div>
      </UContainer>
    </div>

    <div class="bg-green-400 w-[1280px] xl:w-full">
      <UContainer>
        <div class="h-16 flex items-center text-slate-700 text-sm">
          Copyright © {{ new Date().getFullYear() }}
        </div>
      </UContainer>
    </div>
  </div>
</template>

<script setup>
const title = ref("เว็บดูหนังออนไลน์ หนังใหม่ชนโรง 2024");
const moreDetail = reactive([
  {
    title: "เว็บดูหนังออนไลน์ หนังใหม่ชนโรง 2024",
    detail:
      "เว็บดูหนังออนไลน์ฟรี ไม่มีโฆษณา MovieBox.com สำหรับคนรักหนัง ในยุคโควิด 19 คุณไม่จำเป็นต้องออกจากบ้าน เราขอแนะนำเว็บดูหนังออนไลน์ 24hd เว็บดูหนังใหม่ ที่มีหนังให้เลือกดูกว่า 4000 เรื่อง ดูฟรีไม่สะดุด ไม่มีโฆษณากวนใจ สามารถดูได้ผ่าน Smart TV , Android , iOS ได้ทุกเครือข่าย มีให้คุณเลือกดูครบไม่ว่าจะเป็น หนังไทย หนังฝรั่ง หนังจีน เกาหลี หรือจะเป็น หนัง Netflix คุณไม่จำเป็นต้องเสียเงินอีกต่อไป ระบบดูหนังของเรานั้นมีให้เลือก ทั้งหนังพากย์ไทย และ ซับไทย มีตัวเล่นหนังสำรองป้องกันหนังเสีย ระบบซ่อมหนังอัตโนมัติ และที่สำคัญสามารถ ดาวน์โหลดหนังฟรี ได้ครบทุกเรื่อง",
  },
  {
    title: "ดูหนังออนไลน์ฟรี 2024",
    detail:
      "การดูหนังออนไลน์ เป็นสิ่งที่นิยมกันมากในยุคปัจจุบัน ซึ่งถ้าเทียบกับยุคก่อนๆแล้ว การดูหนังสักเรื่องนั้น ไม่ได้ทำง่ายดายเหมือนในยุคปัจบันนี้ ไม่ว่าจะต้องไปเช่าหนัง ตามร้านเช่า vdo แล้วไหนจะต้องหาเครื่องเล่นหนัง หรือ TV เพื่อมาต่อให้ใช้งานได้บางครั้งแผ่นก็มีปัญหาบ้าง ดูหนังไม่ได้บ้างไม่ใช่แค่เสียเงินอย่างเดียวแถมยังเสียเวลาในการใช้ชีวิตที่จะต้องคอยเอาแผ่นไปคืน หรือ ไปเช่าเรื่องใหม่ๆมาดูเพิ่มอีก ซึ่งยุคปัจจุบัน การดูหนังไม่ได้ยากลำบากขนาดนั้นอีกต่อไปแล้ว การดูหนังออนไลน์ นั้นสามารถทำได้ง่ายและสะดวกสบายมากขึ้นเมื่อเทียบกับแต่ก่อน ท่านเพียงแค่จำเว็บไซต์ของเราเอาไว้ 24-hd.com ไม่ว่าท่านจะต้องการดูหนังเรื่องไหน ท่านสามารถใช้งานปุ่มเซิร์ทด้านขวาบน และใส่ชื่อเรื่องหนังที่ท่านต้องการดู ท่านก็จะสามารถ 'ดูหนังออนไลน์' ได้ทันที",
  },
  {
    title: "ดูหนังใหม่ Netflix",
    detail:
      "หลายๆคนคงชอบดูหนังออนไลน์ผ่าน Netflix เพราะมีให้เลือกดูหนังหลากหลาย ไม่ว่าจะเป็น หนังไทย หนังฝรั่ง หนังเกาหลี แถมระบบดูหนังชัดระดับ 4k แต่คงหลีกเลี่ยงข้อเสียการดูหนังใน Netflix ที่สำคัญที่สุดไม่ได้นั้นคือต้องเสียเงินรายเดือนซึ่งเวปของเรานั้นได้นำหนังต่างๆใน Netflix ทุกเรื่องมาลงให้ท่านได้เลือกดูหนังกันแบบฟรีๆไม่มีค่าใช้จ่าย แถมยังสามารถ ดาวน์โหลดหนัง Netflix ไปดูกันได้อีกด้วย การดูหนัง Netflix ผ่านเว็บดูหนังออนไลน์ของเรานั้นท่านจะได้รับประสบการณ์ดูหนังอย่างดีที่สุด ชัดที่สุดเนื่องจากเซิฟเวอร์อัพหนังของเรานั้นมีความเร็วและเสถียรสูงสุด ทำให้ไม่ต้องกังวลถึงจะมีผู้ชมมากมายดูพร้อมกัน ก็ไม่ทำให้ กระตุกหรือภาพแตกแต่อย่างใด",
  },
  {
    title: "ดูหนังบนมือถือ Smart TV",
    detail:
      "หมดปัญหาเรื่อง หนังสะดุด แม้ว่าคุณจะดูหนังบนมือถือ ผ่านสมาร์ททีวี Tablet , iPhone , iPad คุณก็สามารถดูได้ไม่มีสะดุดที่สำคัญคือไม่มีโฆษณากวนใจมาให้คุณคอย Skip และยังสามารถดาวน์หนังเก็บไว้ดูได้ในอนาคตโดยที่ไม่ต้องเปลืองค่า internet 4g อีกด้วย โหลดฟรีโหลดไวเก็บไว้ดูระหว่างเดินทาง ใช้งานง่ายไม่ซับซ้อน",
  },
  {
    title: "ดูหนังออนไลน์ MovieBox.com",
    detail:
      "ทำไมถึงต้องเลือกดูหนังกับเรา ทุกๆท่านคงทราบปัญหาดีในการดูหนังออนไลน์ สิ่งที่สำคัญที่สุดอันดับแรกก็คือ ตัวเล่นหนัง ดูไม่สะดุด สามารถ กรอไปข้างหน้า กรอกลับมาดูก่อนหน้านี้ได้ตลอดเวลา โดยที่ไม่รู้สึกติดขัด ซึ่งตรงนี้เว็บของเรานั้นให้ความสำคัญเป็นพิเศษและมีทีมงานวิศวกรออกแบบตัวเล่นหนังมาเองโดยเฉพาะ ทำให้ตัวเล่นหนังของเรานั้นมีศักยภาพที่เสถียรและเร็วที่สุดในตอนนี้ และสิ่งที่สำคัญต่อมา เว็บไซต์ดูหนังออนไลน์ของเรานั้น มีหนังใหม่ชนโรง หนังเต็มเรื่อง ให้ท่านได้ดูก่อนใคร ดูพร้อมกันกับเครือ Major ชนโรงภาพชัด เสียงไทย เราสามารถการันตีได้เลยว่าในประเทศไทย ไม่มีเว็บดูหนังเว็บไหนที่จะสามารถอัพเดท หนังใหม่ๆ ได้ไวเท่าเว็บเราอีกแล้ว เรามีทีมงานคอยดูแลตลอด",
  },
]);
</script>
